src/app/Models/RecommendationModel.php

SELECT `id`, `nom`, `prenom`, `email`, `genre`, `date_naissance`
FROM `users`
WHERE `id` = 6
SELECT *
FROM `user_health`
WHERE `user_id` = 6
SELECT *
FROM `user_objectifs`
WHERE `user_id` = 6
SELECT *
FROM `objectifs`
WHERE `id` = 3
SELECT *
FROM `age_ranges`
WHERE `age_min` <= 27
AND `age_max` >= 27
---
    public function getSuggestionContext(int $userId): array
    {
        $user = $this->db->table('users')
            ->select('id, nom, prenom, email, genre, date_naissance')
            ->where('id', $userId)
            ->get()
            ->getRowArray();

        $health = $this->db->table('user_health')
            ->where('user_id', $userId)
            ->get()
            ->getRowArray();

        $objectifRow = $this->db->table('user_objectifs')
            ->where('user_id', $userId)
            ->get()
            ->getRowArray();

        if (empty($user) || empty($health) || empty($objectifRow)) {
            return [];
        }

        $objectif = $this->db->table('objectifs')
            ->where('id', (int) $objectifRow['objectif_id'])
            ->get()
            ->getRowArray();

        $age = $this->calculerAge($user['date_naissance'] ?? null);
        $ageRange = $this->db->table('age_ranges')
            ->where('age_min <=', $age)
            ->where('age_max >=', $age)
            ->get()
            ->getRowArray();

SELECT *
FROM `recommendations_weight`
WHERE `age_range_id` = 2
AND `genre` = 'H'
---

        $weightRule = null;
        if (!empty($ageRange)) {
            $weightRule = $this->db->table('recommendations_weight')
                ->where('age_range_id', (int) $ageRange['id'])
                ->where('genre', $user['genre'])
                ->get()
                ->getRowArray();

SELECT `rec`.`id` AS `recommendation_id`, `rec`.`date_debut`, `rec`.`date_fin`, `o`.`nom` AS `objectif_nom`, `r`.`nom` AS `regime_nom`, `a`.`nom` AS `activite_nom`, `a`.`duree_minutes`, `a`.`calories_brulees`, `ar`.`age_min`, `ar`.`age_max`, `hr`.`valeur_min` AS `imc_cible_min`, `hr`.`valeur_max` AS `imc_cible_max`, `rw`.`poids_min` AS `poids_recommande_min`, `rw`.`poids_max` AS `poids_recommande_max`
FROM `users` `u`
LEFT JOIN `user_objectifs` `uo` ON `uo`.`user_id` = `u`.`id`
LEFT JOIN `objectifs` `o` ON `o`.`id` = `uo`.`objectif_id`
LEFT JOIN `recommendations` `rec` ON `rec`.`user_id` = `u`.`id`
LEFT JOIN `regimes` `r` ON `r`.`id` = `rec`.`regime_id`
LEFT JOIN `activites` `a` ON `a`.`id` = `rec`.`activite_id`
LEFT JOIN `age_ranges` `ar` ON TIMESTAMPDIFF(YEAR, u.date_naissance, CURDATE()) BETWEEN ar.age_min AND ar.age_max
LEFT JOIN `health_rules` `hr` ON `hr`.`type` = 'IMC' AND `hr`.`genre` = `u`.`genre` AND `hr`.`age_min` = `ar`.`age_min` AND `hr`.`age_max` = `ar`.`age_max`
LEFT JOIN `recommendations_weight` `rw` ON `rw`.`age_range_id` = `ar`.`id` AND `rw`.`genre` = `u`.`genre`
WHERE `u`.`id` = 6
AND rec.activite_id IS NOT NULL
ORDER BY `rec`.`date_debut` DESC
---
    public function getRecommendedActivitiesTable(int $userId): array
    {
        return $this->db->table('users u')
            ->select('
                rec.id AS recommendation_id,
                rec.date_debut,
                rec.date_fin,
                o.nom AS objectif_nom,
                r.nom AS regime_nom,
                a.nom AS activite_nom,
                a.duree_minutes,
                a.calories_brulees,
                ar.age_min,
                ar.age_max,
                hr.valeur_min AS imc_cible_min,
                hr.valeur_max AS imc_cible_max,
                rw.poids_min AS poids_recommande_min,
                rw.poids_max AS poids_recommande_max
            ')
            ->join('user_objectifs uo', 'uo.user_id = u.id', 'left')
            ->join('objectifs o', 'o.id = uo.objectif_id', 'left')
            ->join('recommendations rec', 'rec.user_id = u.id', 'left')
            ->join('regimes r', 'r.id = rec.regime_id', 'left')
            ->join('activites a', 'a.id = rec.activite_id', 'left')
            ->join('age_ranges ar', 'TIMESTAMPDIFF(YEAR, u.date_naissance, CURDATE()) BETWEEN ar.age_min AND ar.age_max', 'left')
            ->join('health_rules hr', "hr.type = 'IMC' AND hr.genre = u.genre AND hr.age_min = ar.age_min AND hr.age_max = ar.age_max", 'left')
            ->join('recommendations_weight rw', 'rw.age_range_id = ar.id AND rw.genre = u.genre', 'left')
            ->where('u.id', $userId)
            ->where('rec.activite_id IS NOT NULL', null, false)
            ->orderBy('rec.date_debut', 'DESC')
            ->get()
            ->getResultArray();

SELECT `id`, `nom`, `description`, `calories`, `prix`, `duree_jours`
FROM `regimes`
ORDER BY `calories` ASC
---
    private function selectRegimesForContext(array $context): array
    {
        $regimes = $this->db->table('regimes')
            ->select('id, nom, description, calories, prix, duree_jours')
            ->orderBy(
                'calories',
                $context['objectifType'] === 'gain' ? 'DESC' : 'ASC'
            )
            ->get()
            ->getResultArray();

SELECT `id`, `nom`, `description`, `calories_brulees`, `duree_minutes`
FROM `activites`
ORDER BY `calories_brulees` DESC
---
    private function selectActivitesForContext(array $context, int $limit): array
    {
        $activities = $this->db->table('activites')
            ->select('id, nom, description, calories_brulees, duree_minutes')
            ->orderBy(
                'calories_brulees',
                $context['objectifType'] === 'gain' ? 'ASC' : 'DESC'
            )
            ->get()
            ->getResultArray();