src/app/Models/WalletModel.php

    public function getOuCreerParUser(int $userId): array
    {
        $wallet = $this->where('user_id', $userId)->first();
---
SELECT *
FROM `wallet`
WHERE `user_id` = 6
 LIMIT 1