src/app/Controllers/GoldController.php

SELECT *
FROM `abonnements`
WHERE `user_id` = '6'
AND `type` = 'GOLD'
AND `date_fin` >= '2026-05-11'
ORDER BY `date_fin` DESC
 LIMIT 1
---
    public function index()
    {
        $userId = session()->get('id');

        if (!$userId) {
            return redirect()->to('/users/login');
        }

        // BUG CORRIGÉ : getOuCreerParUser évite null → crash dans la vue
        $wallet = $this->walletModel->getOuCreerParUser((int) $userId);

        $goldSubscription = $this->abonnementModel
            ->where('user_id', $userId)
            ->where('type', 'GOLD')
            ->where('date_fin >=', date('Y-m-d'))
            ->orderBy('date_fin', 'DESC')
            ->first();

SELECT *
FROM `abonnements`
WHERE `user_id` IS NULL
AND `type` = 'GOLD'
AND `date_fin` >= '2026-05-11'
 LIMIT 1
---
    public function isGold($userId)
    {
        $gold = $this->abonnementModel
            ->where('user_id', $userId)
            ->where('type', 'GOLD')
            ->where('date_fin >=', date('Y-m-d'))
            ->first();