src/app/Controllers/UsersHomepage.php

SELECT *
FROM `objectifs`
SELECT *
FROM `user_objectifs`
WHERE `user_id` = 6
 LIMIT 1
SELECT *
FROM `objectifs`
WHERE `objectifs`.`id` = 3
---
        $userTailleMeters = (float)$userTaille;
        $userImc = ($userTailleMeters > 0) ? ($userPoids / ($userTailleMeters * $userTailleMeters)) : 0;

        $objectifs = $objectifModel->findAll();
        $userObjectifRow = $userObjectifModel->where('user_id', $userId)->first();
        $objectifId = $userObjectifRow ? (int) $userObjectifRow['objectif_id'] : 0;
        $objectifActuel = $objectifId > 0 ? $objectifModel->find($objectifId) : null;