src/app/Controllers/UsersAuth.php

SELECT *
FROM `users`
WHERE `email` = 'jean@test.mg'
AND `role` = 'user'
 LIMIT 1
---
    public function loginCheck()
    {
        $session  = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $username)
                          ->where('role', 'user')
                          ->first();